// Упражнение 3.11.
// Усовершенствуйте функцию comma так, чтобы она корректно работала с числами с плавающей точкой и необязательным
// знаком.
package main

import (
	"testing"
)

func TestComma(t *testing.T) {
	tests := []struct {
		s, want string
	}{
		{"1.1234", "1.1234"},
		{"12.1234", "12.1234"},
		{"123.1234", "123.1234"},
		{"1234.1234", "1,234.1234"},
		{"12345.1234", "12,345.1234"},
		{"123456.1234", "123,456.1234"},
		{"1234567.1234", "1,234,567.1234"},
		{"12345678.1234", "12,345,678.1234"},
		{"123456789.1234", "123,456,789.1234"},
		{"1234567890.1234", "1,234,567,890.1234"},
		{"+123456789.1234", "+123,456,789.1234"},
		{"-1234567890.1234", "-1,234,567,890.1234"},
	}
	for _, test := range tests {
		got := comma(test.s)
		if got != test.want {
			t.Errorf("comma(%q), got %q, want %q", test.s, got, test.want)
		}
	}
}
